Flashcard-App/app/controllers/instances_controller.rb

  def set_instance
    @instance = Instance.find(params[:id])
---
SELECT  "instances".* FROM "instances" WHERE "instances"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]