Flashcard-App/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @question = Question.all

INSERT INTO "questions" ("q_value", "a_value", "created_at", "updated_at", "quiz_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["q_value", "asdf"], ["a_value", "asdf"], ["created_at", "2018-06-04 15:19:25.793588"], ["updated_at", "2018-06-04 15:19:25.793588"], ["quiz_id", 101]]
---
  def create
    @question = Question.new(question_params_for_create)
    if @question.save